Revit 2027 API
Space.SensibleHeatGainperPerson Property
Get or set the Sensible Heat Gain per Person of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SensibleHeatGainperPerson { get; set; }
Public Property SensibleHeatGainperPerson As Double
	Get
	Set
public:
property double SensibleHeatGainperPerson {
	double get ();
	void set (double value);
}
member SensibleHeatGainperPerson : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Sensible Heat Gain per Person of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace